Revit 2027 API
ColumnAttachment.Justification Property
 Identifies the type of justification to apply to this ColumnAttachment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ColumnAttachmentJustification Justification { get; }
Public ReadOnly Property Justification As ColumnAttachmentJustification
	Get
public:
property ColumnAttachmentJustification Justification {
	ColumnAttachmentJustification get ();
}
member Justification : ColumnAttachmentJustification with get
Property Value
ColumnAttachmentJustification
See Also
Reference
ColumnAttachment Class
Autodesk.Revit.DB Namespace